<a href="https://colab.research.google.com/github/dipucriodigital/engenharia-de-software/blob/main/banco-de-dados/BD_Aula1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Banco de Dados - Prof. Sérgio Lifschitz

---

## Lista 01: Introdução Básica

## Instalação e Configuração do PostgreSQL

In [1]:
%%capture
# Instalação do PostgreSQL
!sudo apt-get -y -qq update
!sudo apt-get -y -qq install postgresql
!sudo service postgresql start
# Alterando a senha do usuário padrão 'postgres' para 'postgres'
!sudo -u postgres psql -U postgres -c "ALTER USER postgres PASSWORD 'postgres';"

## Preparo do esquema Carros

In [ ]:
# Monta o diretório do Google Drive no seu Colab
from google.colab import drive
drive.mount('/content/drive')

In [ ]:
!sudo -u postgres psql -U postgres -c 'DROP SCHEMA IF EXISTS carros CASCADE;'
!sudo -u postgres psql -U postgres -c 'CREATE SCHEMA carros;'

# Se o arquivo com o esquema do banco de dados estiver no diretório padrão do Google Drive, utilize o comando abaixo
# !PGPASSWORD='postgres' psql -h localhost -U postgres -d postgres -a -f drive/MyDrive/esquema_carros.sql

# Senão, substitua path do comando abaixo pelo caminho no seu Google Drive (exemplo abaixo do comando comentado).
# !PGPASSWORD='postgres' psql -h localhost -U postgres -d postgres -a -f /content/drive/MyDrive/path/esquema_carros.sql
!PGPASSWORD='postgres' psql -h localhost -U postgres -d postgres -a -f /content/drive/MyDrive/AulasBD/esquema_carros.sql

NOTICE:  schema "carros" does not exist, skipping
DROP SCHEMA
CREATE SCHEMA
SET SCHEMA 'carros';
SET
CREATE TABLE carros.automoveis (
    codigo integer NOT NULL,
    ano character(2) NOT NULL,
    fabricante character(20),
    modelo character(20),
    preco_tabela numeric(8,2),
    pais character(20)
);
CREATE TABLE
CREATE TABLE carros.consumidores (
    cpf character(12) NOT NULL,
    nome character(15),
    sobrenome character(15),
    cidade character(25),
    estado character(2)
);
CREATE TABLE
CREATE TABLE carros.garagens (
    codigo integer NOT NULL,
    ano character(2) NOT NULL,
    cgc integer NOT NULL,
    quantidade integer
);
CREATE TABLE
CREATE TABLE carros.negocios (
    codigo integer NOT NULL,
    ano character(2) NOT NULL,
    cgc integer NOT NULL,
    cpf character(12) NOT NULL,
    data date,
    preco numeric(8,2)
);
CREATE TABLE
CREATE TABLE carros.revendedoras (
    cgc integer NOT NULL,
    nome character(20),
    estado character(2),
    cidade character(25),
    proprietario character(12)
);
CREATE TABLE
CREATE FUNCTION carros.conta(cgc_in integer, ano_in character) RETURNS integer
    LANGUAGE plpgsql
    AS $$
DECLARE
    total integer;
BEGIN
    select sum(quantidade) into total
    from garagens g where g.cgc = cgc_in and g.ano = ano_in;
    return total;
END;
$$;
CREATE FUNCTION
CREATE FUNCTION carros.increment(i integer) RETURNS integer
    LANGUAGE plpgsql
    AS $$
        BEGIN
                RETURN i + 1;
        END;
$$;
CREATE FUNCTION
CREATE FUNCTION carros.tem_estoque() RETURNS trigger
    LANGUAGE plpgsql
    AS $$
DECLARE
    qtd integer;
BEGIN
    qtd:=0;
    select quantidade into qtd from garagens g
    where g.cgc = New.cgc and g.codigo = New.codigo and g.ano = New.ano;
    RAISE INFO 'qtd=%', qtd;
    if (qtd<=0) or qtd is NULL then
        RAISE EXCEPTION 'Nao tem o carro % - ano % em estoque', NEW.codigo, NEW.ano;
    RETURN NULL;
    end if;
    RETURN NEW;
END;
$$;
CREATE FUNCTION
INSERT INTO carros.automoveis VALUES (1022, '85', 'Ford                ', 'Del Rey             ', 4800.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1051, '88', 'Fiat                ', 'Elba                ', 6200.00, 'Italia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1051, '89', 'Fiat                ', 'Elba                ', 7600.00, 'Italia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1023, '87', 'Ford                ', 'Escort              ', 7000.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1023, '88', 'Ford                ', 'Escort              ', 7800.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1013, '95', 'Volkswagen          ', 'Kombi               ', 12000.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1061, '94', 'General Motors      ', 'Monza               ', 18000.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1014, '95', 'Volkswagen          ', 'Parati              ', 15200.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1071, '93', 'Gurgel              ', 'BR800               ', 6500.00, 'Brasil              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1081, '90', 'Honda               ', 'Accord              ', 37000.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1281, '94', 'Hyundai             ', 'Excel               ', 19500.00, 'Coreia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1101, '92', 'Lada                ', 'Laika               ', 5500.00, 'Russia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1101, '93', 'Lada                ', 'Laika               ', 6200.00, 'Russia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1052, '93', 'Fiat                ', 'Tempra              ', 18800.00, 'Italia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1111, '95', 'Suzuki              ', 'Sidekick            ', 36000.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1102, '92', 'Lada                ', 'Niva                ', 7800.00, 'Russia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1071, '94', 'Gurgel              ', 'BR800               ', 7500.00, 'Brasil              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1131, '95', 'Peugeot             ', '205                 ', 11400.00, 'Franca              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1053, '95', 'Fiat                ', 'Tipo                ', 13000.00, 'Italia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1082, '95', 'Honda               ', 'Civic               ', 22870.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1141, '95', 'Audi                ', '80                  ', 52000.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1142, '95', 'Audi                ', '100                 ', 60000.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1151, '95', 'BMW                 ', '318                 ', 51000.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1011, '90', 'Volkswagen          ', 'Apollo              ', 9000.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1011, '92', 'Volkswagen          ', 'Apollo              ', 10600.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1014, '94', 'Volkswagen          ', 'Parati              ', 12400.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1061, '88', 'General Motors      ', 'Monza               ', 7500.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1052, '94', 'Fiat                ', 'Tempra              ', 20500.00, 'Italia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1023, '89', 'Ford                ', 'Escort              ', 8300.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1051, '90', 'Fiat                ', 'Elba                ', 10800.00, 'Italia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1023, '90', 'Ford                ', 'Escort              ', 9000.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1021, '89', 'Ford                ', 'Belina              ', 8800.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1033, '95', 'Chevrolet           ', 'Corsa GL            ', 11950.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1011, '93', 'Volkswagen          ', 'Apollo              ', 11100.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1052, '95', 'Fiat                ', 'Tempra              ', 34000.00, 'Italia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1161, '95', 'Volvo               ', '460                 ', 40000.00, 'Suecia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1171, '95', 'Daihatsu            ', 'Charade             ', 20000.00, 'Coreia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1181, '95', 'Porsche             ', '938 GTS             ', 180000.00, 'UK                  ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1132, '95', 'Peugeot             ', '405                 ', 30000.00, 'Franca              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1133, '95', 'Peugeot             ', '605                 ', 55000.00, 'Franca              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1282, '95', 'Hyundai             ', 'Elantra             ', 27000.00, 'Coreia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1162, '95', 'Volvo               ', '850                 ', 70000.00, 'Suecia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1191, '95', 'Mercedez Benz       ', 'C200                ', 60000.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1122, '95', 'Renault             ', '19                  ', 25000.00, 'Franca              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1022, '86', 'Ford                ', 'Del Rey             ', 6000.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1023, '92', 'Ford                ', 'Escort              ', 9700.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1023, '93', 'Ford                ', 'Escort              ', 10800.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1051, '95', 'Fiat                ', 'Elba                ', 18300.00, 'Italia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1061, '89', 'General Motors      ', 'Monza               ', 9800.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1103, '92', 'Lada                ', 'Samara              ', 8000.00, 'Russia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1152, '95', 'BMW                 ', '325                 ', 68000.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1153, '95', 'BMW                 ', '530                 ', 93000.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1201, '95', 'Ferrari             ', '512                 ', 330000.00, 'Italia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1211, '95', 'Land Rover          ', 'Defender            ', 35000.00, 'Inglaterra          ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1221, '95', 'Mitsubishi          ', 'Pajero              ', 45000.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1231, '95', 'Mazda               ', '626                 ', 36000.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1123, '95', 'Renault             ', 'Nevada              ', 27000.00, 'Franca              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1241, '95', 'Rolls Royce         ', 'Corniche            ', 499000.00, 'Inglaterra          ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1112, '95', 'Suzuki              ', 'Canvas              ', 15000.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1192, '95', 'Mercedez Benz       ', 'C280                ', 70000.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1251, '95', 'Toyota              ', 'Paseo               ', 35000.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1043, '95', 'Citroen             ', 'ZX                  ', 30000.00, 'Franca              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1021, '88', 'Ford                ', 'Belina              ', 8000.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1104, '92', 'Lada                ', 'Pantanal            ', 8500.00, 'Russia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1023, '91', 'Ford                ', 'Escort              ', 14400.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1032, '92', 'Chevrolet           ', 'Chevette            ', 7200.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1081, '95', 'Honda               ', 'Accord              ', 48000.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1022, '87', 'Ford                ', 'Del Rey             ', 7000.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1012, '90', 'Volkswagen          ', 'Gol                 ', 7300.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1012, '92', 'Volkswagen          ', 'Gol                 ', 8000.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1012, '94', 'Volkswagen          ', 'Gol                 ', 9300.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1031, '95', 'Chevrolet           ', 'Corsa Wind          ', 7350.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1051, '93', 'Fiat                ', 'Elba                ', 12600.00, 'Italia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1261, '95', 'Nissan              ', 'Sentra              ', 38000.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1113, '95', 'Suzuki              ', 'Vitara              ', 25000.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1222, '95', 'Mitsubishi          ', 'Galant              ', 40000.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1154, '95', 'BMW                 ', '840                 ', 147000.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1232, '95', 'Mazda               ', 'MX                  ', 32000.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1252, '95', 'Toyota              ', 'Corolla             ', 38000.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1014, '93', 'Volkswagen          ', 'Parati              ', 10800.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1081, '93', 'Honda               ', 'Accord              ', 40000.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1061, '93', 'General Motors      ', 'Monza               ', 16000.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1061, '90', 'General Motors      ', 'Monza               ', 11000.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1014, '90', 'Volkswagen          ', 'Parati              ', 8800.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1044, '95', 'Citroen             ', 'XM                  ', 65000.00, 'Franca              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1124, '95', 'Renault             ', '21                  ', 29000.00, 'Franca              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1202, '95', 'Ferrari             ', '348                 ', 215000.00, 'Italia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1233, '95', 'Mazda               ', 'Protege             ', 26000.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1262, '95', 'Nissan              ', 'Pathfinder          ', 43000.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1182, '95', 'Porsche             ', '921 Carrera         ', 140000.00, 'Inglaterra          ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1271, '95', 'Daewoo              ', 'Espero              ', 23000.00, 'Coreia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1041, '94', 'Citroen             ', 'AX                  ', 21000.00, 'Franca              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1021, '87', 'Ford                ', 'Belina              ', 5700.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1212, '95', 'Land Rover          ', 'Discovery           ', 63000.00, 'Inglaterra          ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1114, '95', 'Suzuki              ', 'Swift               ', 20000.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1193, '95', 'Mercedes Benz       ', 'E280                ', 85000.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1172, '95', 'Daihatsu            ', 'Feroza              ', 28000.00, 'Coreia              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1253, '95', 'Toyota              ', 'Previa              ', 68000.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1194, '95', 'Mercedes Benz       ', 'S500                ', 170000.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1223, '95', 'Mitsubishi          ', 'Lancer              ', 29000.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1022, '89', 'Ford                ', 'Del Rey             ', 9300.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1023, '94', 'Ford                ', 'Escort              ', 12500.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1014, '92', 'Volkswagen          ', 'Parati              ', 9800.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1254, '95', 'Toyota              ', 'Hilux               ', 52000.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1115, '95', 'Suzuki              ', 'Samurai             ', 18000.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1083, '95', 'Honda               ', 'Legend              ', 90000.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (99000, '02', 'Renault             ', 'Twingo              ', 11890.00, 'Franca              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1032, '93', 'Chevrolet           ', 'Chevette            ', 7900.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1032, '89', 'Chevrolet           ', 'Chevette            ', 7000.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1032, '87', 'Chevrolet           ', 'Chevette            ', 6000.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1032, '84', 'Chevrolet           ', 'Chevette            ', 4300.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1012, '93', 'Volkswagen          ', 'Gol                 ', 8600.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1012, '95', 'Volkswagen          ', 'Gol                 ', 10500.00, 'Alemanha            ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1041, '95', 'Citroen             ', 'AX                  ', 25000.00, 'Franca              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (99001, '02', 'Citroen             ', 'C5                  ', 16000.00, 'Franca              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (88374, '99', 'Jac                 ', 'J3                  ', 4800.00, 'Brasil              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (957798, '02', 'Ford                ', 'Fiesta              ', 100000.00, 'Brasil              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1300, '17', 'Fiat                ', 'Uno 2016            ', 50000.00, 'Brasil              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1042, '19', 'Citroen             ', 'Xantia              ', 46000.00, 'Franca              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1121, '95', 'Renault             ', 'Twin                ', 11322.00, 'Franca              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1020, '85', 'Ford                ', 'Del Rey             ', 4105.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1306, '20', 'Suzuki              ', 'Jimmy               ', 66288.00, 'Japao               ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (1308, '20', 'Peugeot             ', '2008                ', 65817.00, 'Franca              ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (101, '89', 'Ford                ', 'Ka                  ', 50.00, 'EUA                 ');
INSERT 0 1
INSERT INTO carros.automoveis VALUES (100, '90', 'Ford                ', 'Ka                  ', 100.00, 'EUA                 ');
INSERT 0 1

## Preparando para usar o PostgreSQL

In [ ]:
# Configurando o PostgreSQL na variável de ambiente DATABASE_URL
%env DATABASE_URL=postgresql://postgres:postgres@localhost:5432/postgres

env: DATABASE_URL=postgresql://postgres:postgres@localhost:5432/postgres

In [ ]:
# Carregando a extensão sql para usar o SQL pelo Google Colab
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

## Exercícios do esquema Carros

### Esquema relacional da base de dados Carros:

<img src='https://drive.google.com/uc?export=view&id=1pIB4LORRz4J2gwEjM_qxwVYHDlqXGg5Y'>

Chaves primárias sublinhadas e chaves estrangeiras em itálico.

In [ ]:
%sql postgresql://postgres:postgres@localhost:5432/postgres

__init__() got an unexpected keyword argument 'bind'
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

In [ ]:
# Escolhe o esquema carros como o esquema em que serão feitas as consultas
# (deve-se executar essa célula sempre que for trocar para o esquema carros)
%%sql
SET SCHEMA 'carros';

__init__() got an unexpected keyword argument 'bind'
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

### 1. Listar os nomes dos fabricantes dos automóveis na base de dados e os respectivos países de fabricação originalmente.

In [ ]:
%%sql
SELECT DISTINCT Fabricante, Pais
FROM automoveis;

__init__() got an unexpected keyword argument 'bind'
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

### 2.  Listar os estados onde se vende o modelo Elba, do fabricante Fiat.

In [ ]:
%%sql
SELECT DISTINCT Estado
FROM Automoveis A, Revendedoras R, Garagens G
WHERE A.Codigo = G.Codigo
AND G.CGC = R.CGC
AND A.Modelo = 'Elba'
AND A.Fabricante = 'Fiat';

__init__() got an unexpected keyword argument 'bind'
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

### 3. Quais são as revendedoras de mesmo proprietário presentes em mais de um estado?

In [ ]:
%%sql
SELECT DISTINCT R1.*
FROM revendedoras R1, Revendedoras R2
WHERE R1.proprietario = R2.proprietario
AND R1.estado <> R2.estado;

__init__() got an unexpected keyword argument 'bind'
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])

### 4. Listar o CGC e o nome das revendedoras que venderam carros japoneses ou americanos, fabricados no ano 95, por valor até 30% acima do preço de tabela.

In [ ]:
%%sql
SELECT DISTINCT r.cgc, r.nome
FROM revendedoras R, negocios N, automoveis A
WHERE R.cgc = N.cgc
AND A.codigo = N.Codigo
AND A.ano = N.Ano
AND A.pais IN ('Japao', 'EUA')
AND A.ano = '95'
AND N.preco > A.preco_tabela
AND N.preco <= (1.3 * A.preco_tabela);

__init__() got an unexpected keyword argument 'bind'
Connection info needed in SQLAlchemy format, example:
               postgresql://username:password@hostname/dbname
               or an existing connection: dict_keys([])